# SQL Bootcamp Assessment Test 2

In [55]:
import numpy as np
import pandas as pd
import psycopg2

In [56]:
# make database connection
conn_str = "host='10.0.0.12' dbname='sqlboot_ass2' user='scruffy' password='D4dmiscreant#'"
conn = psycopg2.connect(conn_str)

## Question 1
How can you retrieve all the information from the cd.facilities table?

In [57]:
q1_qry = """
    select *
    from cd.facilities;
"""
q1_df = pd.read_sql(q1_qry, conn)
q1_df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000.0,200.0
1,1,Tennis Court 2,5.0,25.0,8000.0,200.0
2,2,Badminton Court,0.0,15.5,4000.0,50.0
3,3,Table Tennis,0.0,5.0,320.0,10.0
4,4,Massage Room 1,35.0,80.0,4000.0,3000.0
5,5,Massage Room 2,35.0,80.0,4000.0,3000.0
6,6,Squash Court,3.5,17.5,5000.0,80.0
7,7,Snooker Table,0.0,5.0,450.0,15.0
8,8,Pool Table,0.0,5.0,400.0,15.0

## Question 2
You want to print out a list of all of the facilities and their cost to members. How would you retrieve a list of only facility names and costs?

In [58]:
q2_qry = """
    select name, membercost
    from cd.facilities;
"""
q2_df = pd.read_sql(q2_qry, conn)
q2_df

              name  membercost
0   Tennis Court 1         5.0
1   Tennis Court 2         5.0
2  Badminton Court         0.0
3     Table Tennis         0.0
4   Massage Room 1        35.0
5   Massage Room 2        35.0
6     Squash Court         3.5
7    Snooker Table         0.0
8       Pool Table         0.0

## Question 3
How can you produce a list of facilities that charge a fee to members?

In [59]:
q3_qry = """
    select name
    from cd.facilities
    where membercost > 0
"""
q3_df = pd.read_sql(q3_qry, conn)
q3_df

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

## Question 4
How can you produce a list of facilities that charge a fee to members, and that fee is less than 1/50th of the monthly maintenance cost? Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [60]:
q4_qry = """
    select facid, name, membercost, monthlymaintenance
    from cd.facilities
    where membercost > 0
    and (membercost < (monthlymaintenance / 50.0));
"""
q4_df = pd.read_sql(q4_qry, conn)
q4_df

   facid            name  membercost  monthlymaintenance
0      4  Massage Room 1        35.0              3000.0
1      5  Massage Room 2        35.0              3000.0

## Question 5
How can you produce a list of all facilities with the word 'Tennis' in their name?

In [61]:
q5_qry = """
    select name
    from cd.facilities
    where name like '%Tennis%';
"""
q5_df = pd.read_sql(q5_qry, conn)
q5_df

             name
0  Tennis Court 1
1  Tennis Court 2
2    Table Tennis

## Question 6
How can you retrieve the details of facilities with ID 1 and 5? Try to do it without using the OR operator.

In [62]:
q6_qry = """
    select *
    from cd.facilities
    where facid in (1, 5);
"""
q6_df = pd.read_sql(q6_qry, conn)
q6_df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000.0,200.0
1,5,Massage Room 2,35.0,80.0,4000.0,3000.0

## Question 7
How can you produce a list of members who joined after the start of September 2012? Return the memid, surname, firstname, and joindate of the members in question.

In [63]:
q7_qry = """
    select memid, surname, firstname, joindate
    from cd.members
    where joindate >= '2012-09-01';
"""
q7_df = pd.read_sql(q7_qry, conn)
q7_df

   memid            surname  firstname            joindate
0     24             Sarwin  Ramnaresh 2012-09-01 08:44:42
1     26              Jones    Douglas 2012-09-02 18:43:05
2     27             Rumney  Henrietta 2012-09-05 08:42:35
3     28            Farrell      David 2012-09-15 08:22:05
4     29  Worthington-Smyth      Henry 2012-09-17 12:27:15
5     30            Purview  Millicent 2012-09-18 19:04:01
6     33         Tupperware   Hyacinth 2012-09-18 19:32:05
7     35               Hunt       John 2012-09-19 11:32:45
8     36            Crumpet      Erica 2012-09-22 08:36:38
9     37              Smith     Darren 2012-09-26 18:08:45

## Question 8
How can you produce an ordered list of the first 10 surnames in the members table? The list must not contain duplicates.

In [64]:
q8_qry = """
    select distinct(surname)
    from cd.members
    order by surname
    limit 10;
"""
q7_df = pd.read_sql(q8_qry, conn)
q7_df

   surname
0    Bader
1    Baker
2   Boothe
3  Butters
4   Coplin
5  Crumpet
6     Dare
7  Farrell
8  Genting
9    GUEST

## Question 9
You'd like to get the signup date of your last member. How can you retrieve this information?

In [65]:
q9_qry = """
    select max(joindate) as latest_joindate
    from cd.members;
"""
q9_df = pd.read_sql(q9_qry, conn)
q9_df

      latest_joindate
0 2012-09-26 18:08:45

## Question 10
Produce a count of the number of facilities that have a cost to guests of 10 or more.

In [66]:
q10_qry = """
    select count(*) as num_facs_cost_gt10
    from cd.facilities
    where guestcost >= 10;
"""
q10_df = pd.read_sql(q10_qry, conn)
q10_df

   num_facs_cost_gt10
0                   6

## Question 12
### no question 11, skipped by instructor
Produce a list of the total number of slots booked per facility in the month of September 2012. Produce an output table consisting of facility id and slots, sorted by the number of slots.

In [67]:
q12_qry = """
    select facid, sum(slots) as num_slots
    from cd.bookings
    where starttime between '2012-09-01' and '2012-10-01'
    group by facid
    order by num_slots;
"""
q12_df = pd.read_sql(q12_qry, conn)
q12_df

   facid  num_slots
0      5        122
1      3        422
2      7        426
3      8        471
4      6        540
5      2        570
6      1        588
7      0        591
8      4        648

## Question 13
Produce a list of facilities with more than 1000 slots booked. Produce an output table consisting of facility id and total slots, sorted by facility id.

In [68]:
q13_qry = """
    select facid, sum(slots) as num_slots
    from cd.bookings
    group by facid
    having sum(slots) > 1000
    order by facid;
"""
q13_df = pd.read_sql(q13_qry, conn)
q13_df

   facid  num_slots
0      0       1320
1      1       1278
2      2       1209
3      4       1404
4      6       1104

## Question 14
How can you produce a list of the start times for bookings for tennis courts, for the date '2012-09-21'? Return a list of start time and facility name pairings, ordered by the time.

In [69]:
q14_qry = """
    select bkgs.starttime, facs.name
    from cd.bookings as bkgs
    join cd.facilities as facs
    on bkgs.facid = facs.facid
    where bkgs.facid in (0, 1)
    and date_trunc('day', bkgs.starttime) = '2012-09-21'
    order by bkgs.starttime;
"""
q14_df = pd.read_sql(q14_qry, conn)
q14_df

             starttime            name
0  2012-09-21 08:00:00  Tennis Court 1
1  2012-09-21 08:00:00  Tennis Court 2
2  2012-09-21 09:30:00  Tennis Court 1
3  2012-09-21 10:00:00  Tennis Court 2
4  2012-09-21 11:30:00  Tennis Court 2
5  2012-09-21 12:00:00  Tennis Court 1
6  2012-09-21 13:30:00  Tennis Court 1
7  2012-09-21 14:00:00  Tennis Court 2
8  2012-09-21 15:30:00  Tennis Court 1
9  2012-09-21 16:00:00  Tennis Court 2
10 2012-09-21 17:00:00  Tennis Court 1
11 2012-09-21 18:00:00  Tennis Court 2

## Question 15
How can you produce a list of the start times for bookings by members named 'David Farrell'?

In [70]:
q15_qry = """
    select bkgs.starttime, concat(firstname, ' ', surname) as fullname
    from cd.bookings as bkgs
    join cd.members as mems
    on bkgs.memid = mems.memid
    where concat(firstname, ' ', surname) = 'David Farrell';
"""
q15_df = pd.read_sql(q15_qry, conn)
q15_df

             starttime       fullname
0  2012-09-18 09:00:00  David Farrell
1  2012-09-18 17:30:00  David Farrell
2  2012-09-18 13:30:00  David Farrell
3  2012-09-18 20:00:00  David Farrell
4  2012-09-19 09:30:00  David Farrell
5  2012-09-19 15:00:00  David Farrell
6  2012-09-19 12:00:00  David Farrell
7  2012-09-20 15:30:00  David Farrell
8  2012-09-20 11:30:00  David Farrell
9  2012-09-20 14:00:00  David Farrell
10 2012-09-21 10:30:00  David Farrell
11 2012-09-21 14:00:00  David Farrell
12 2012-09-22 08:30:00  David Farrell
13 2012-09-22 17:00:00  David Farrell
14 2012-09-23 08:30:00  David Farrell
15 2012-09-23 17:30:00  David Farrell
16 2012-09-23 19:00:00  David Farrell
17 2012-09-24 08:00:00  David Farrell
18 2012-09-24 16:30:00  David Farrell
19 2012-09-24 12:30:00  David Farrell
20 2012-09-25 15:30:00  David Farrell
21 2012-09-25 17:00:00  David Farrell
22 2012-09-26 13:00:00  David Farrell
23 2012-09-26 17:00:00  David Farrell
24 2012-09-27 08:00:00  David Farrell
25 2012-09-28 11:30:00  David Farrell
26 2012-09-28 09:30:00  David Farrell
27 2012-09-28 13:00:00  David Farrell
28 2012-09-29 16:00:00  David Farrell
29 2012-09-29 10:30:00  David Farrell
30 2012-09-29 13:30:00  David Farrell
31 2012-09-29 14:30:00  David Farrell
32 2012-09-29 17:30:00  David Farrell
33 2012-09-30 14:30:00  David Farrell